app/views/bios/_preview.html.erb

SELECT 1 AS one FROM "sections" WHERE "sections"."bio_id" = ? LIMIT ?  [["bio_id", 1], ["LIMIT", 1]]
---
  <!-- Empty State -->
  <% if bio.sections.all? { |s| s.fields.none? { |f| f.value.present? } } %>