app/views/bios/debug.html.erb

    <h2>Current Bio Records:</h2>
    <% Bio.all.each do |bio| %>
---
SELECT "bios".* FROM "bios"

        <strong>Edit Token:</strong> <%= bio.edit_token %> |
        <strong>Sections:</strong> <%= bio.sections.count %> |
        <strong>Fields:</strong> <%= bio.fields.count %>
---
SELECT COUNT(*) FROM "sections" WHERE "sections"."bio_id" = ?  [["bio_id", 1]]
SELECT COUNT(*) FROM "fields" INNER JOIN "sections" ON "fields"."section_id" = "sections"."id" WHERE "sections"."bio_id" = ?  [["bio_id", 1]]

    <a href="/" class="btn">Homepage</a>
    <% if Bio.first %>
      <a href="/e/<%= Bio.first.edit_token %>" class="btn">Edit First Bio</a>
      <a href="/b/<%= Bio.first.slug %>" class="btn">View First Bio</a>
---
SELECT "bios".* FROM "bios" ORDER BY "bios"."id" ASC LIMIT ?  [["LIMIT", 1]]