lib/tasks/clear_data.rake

  task clear_all: :environment do
    puts "Clearing all biodata records..."

    # Clear in the correct order to avoid foreign key constraints
    Visit.destroy_all
    puts "✓ Visits cleared"

    BiodataField.destroy_all
    puts "✓ Biodata fields cleared"

    BiodataSection.destroy_all
---
DELETE FROM "visits" WHERE "visits"."id" = ?  [["id", 1]]
DELETE FROM "biodata_fields" WHERE "biodata_fields"."id" = ?  [["id", 23]]
DELETE FROM "biodata" WHERE "biodata"."id" = ?  [["id", 4]]
DELETE FROM "biodata_sections" WHERE "biodata_sections"."id" = ?  [["id", 8]]