app/controllers/biodata_controller.rb

SELECT 1 AS one FROM "biodata_sections" WHERE "biodata_sections"."biodatum_id" = ? LIMIT ?  [["biodatum_id", 3], ["LIMIT", 1]]
---
  def setup_default_sections
    return if @biodatum.biodata_sections.any?