app/controllers/biodata_controller.rb

  def create
    @biodatum = Biodatum.new(biodatum_params)

    # Set default name if empty
    @biodatum.name = "Untitled Biodata" if @biodatum.name.blank?

    # Create default sections if none provided or all are empty
    if params[:biodatum].blank? || params[:biodatum][:biodata_sections_attributes].blank?
      setup_default_sections
    else
      # Filter out empty sections and fields
      params[:biodatum][:biodata_sections_attributes].each do |key, section_attrs|
        # Remove empty sections
        if section_attrs[:name].blank?
          section_attrs[:_destroy] = '1'
        else
          # Filter out empty fields within sections
          if section_attrs[:biodata_fields_attributes].present?
            section_attrs[:biodata_fields_attributes].each do |field_key, field_attrs|
              if field_attrs[:label].blank? && field_attrs[:value].blank?
                field_attrs[:_destroy] = '1'
              end
            end
          end
        end
      end
    end

    if @biodatum.save
---
INSERT INTO "biodata" ("name", "slug", "photo", "background_template", "description", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def show
    # Track the visit
    @biodatum.visits.create!(
      ip_address: request.remote_ip,
      user_agent: request.user_agent,
      visited_at: Time.current
    )
---
INSERT INTO "visits" ("biodatum_id", "ip_address", "user_agent", "visited_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

  def preview
    # Track the visit
    @biodatum.visits.create!(
      ip_address: request.remote_ip,
      user_agent: request.user_agent,
      visited_at: Time.current
    )
---
INSERT INTO "visits" ("biodatum_id", "ip_address", "user_agent", "visited_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

  def setup_default_sections
    return if @biodatum.biodata_sections.any?
---
SELECT 1 AS one FROM "biodata_sections" WHERE "biodata_sections"."biodatum_id" = ? LIMIT ?  [["biodatum_id", 12], ["LIMIT", 1]]