app/controllers/bios_controller.rb

  def create
    @bio = Bio.new(bio_params)
    @bio.template ||= 'classic'  # Set default template if not provided

    if @bio.save
      # Create default sections and fields
      Bio.default_sections.each do |section_attrs|
        section = @bio.sections.create!(section_attrs)
        Bio.default_fields_for_section(section_attrs[:name]).each do |field_attrs|
          section.fields.create!(field_attrs)
        end
      end

      # Debug: Check if sections were created
      Rails.logger.info "Created bio with #{@bio.sections.count} sections and #{@bio.fields.count} fields"
---
INSERT INTO "bios" ("slug", "edit_token", "language_code", "created_at", "updated_at", "template") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["slug", "bio-d61c3758"], ["edit_token", "[FILTERED]"], ["language_code", "en"], ["created_at", "2025-08-03 14:36:45.159219"], ["updated_at", "2025-08-03 14:36:45.159219"], ["template", "classic"]]
INSERT INTO "sections" ("bio_id", "name", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["bio_id", 26], ["name", "Personal Details"], ["position", 1], ["created_at", "2025-08-03 14:36:45.223942"], ["updated_at", "2025-08-03 14:36:45.223942"]]
INSERT INTO "fields" ("section_id", "label", "value", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["section_id", 101], ["label", "Full Name"], ["value", ""], ["position", 1], ["created_at", "2025-08-03 14:36:45.273034"], ["updated_at", "2025-08-03 14:36:45.273034"]]
SELECT COUNT(*) FROM "fields" INNER JOIN "sections" ON "fields"."section_id" = "sections"."id" WHERE "sections"."bio_id" = ?  [["bio_id", 26]]
SELECT COUNT(*) FROM "sections" WHERE "sections"."bio_id" = ?  [["bio_id", 26]]

  def edit
    # Ensure we have all sections and fields
    if @bio.sections.empty?
---
SELECT 1 AS one FROM "sections" WHERE "sections"."bio_id" = ? LIMIT ?  [["bio_id", 21], ["LIMIT", 1]]

  def update
    # Debug logging
    Rails.logger.info "Update params: #{params.inspect}"
    Rails.logger.info "Bio params: #{bio_params.inspect}"

    # Check if language is being changed
    language_changed = @bio.language_code != bio_params[:language_code]

    if @bio.update(bio_params)
---
UPDATE "bios" SET "language_code" = ?, "updated_at" = ? WHERE "bios"."id" = ?  [["language_code", "hi"], ["updated_at", "2025-08-03 14:42:14.811191"], ["id", 29]]

  def set_bio
    @bio = Bio.find(params[:id])
---
SELECT "bios".* FROM "bios" WHERE "bios"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]

  def set_bio_by_edit_token
    @bio = Bio.find_by!(edit_token: params[:edit_token])
---
SELECT "bios".* FROM "bios" WHERE "bios"."edit_token" = ? LIMIT ?  [["edit_token", "[FILTERED]"], ["LIMIT", 1]]

  def update_field_labels_for_language
    # Update field labels based on the new language
    @bio.sections.each do |section|
      section.fields.each do |field|
        # Only update if the field has a default English label
        if Bio.default_fields_for_section(section.name).any? { |f| f[:label] == field.label }
          localized_label = @bio.get_localized_label(field.label)
          field.update(label: localized_label) if localized_label != field.label
---
UPDATE "fields" SET "label" = ?, "updated_at" = ? WHERE "fields"."id" = ?  [["label", "पूरा नाम"], ["updated_at", "2025-08-03 14:42:14.825607"], ["id", 701]]