app/controllers/bios_controller.rb

  def set_bio
    @bio = Bio.find(params[:id])
---
SELECT "bios".* FROM "bios" WHERE "bios"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def set_bio_by_edit_token
    @bio = Bio.find_by!(edit_token: params[:edit_token])
---
SELECT "bios".* FROM "bios" WHERE "bios"."edit_token" = ? LIMIT ?  [["edit_token", "[FILTERED]"], ["LIMIT", 1]]