app/views/biodata/edit.html.erb

SELECT 1 AS one FROM "biodata_sections" WHERE "biodata_sections"."biodatum_id" = ? LIMIT ?  [["biodatum_id", 3], ["LIMIT", 1]]
---
        <!-- Empty State -->
        <div id="empty-state" class="text-center py-12 <%= @biodatum.biodata_sections.any? ? 'hidden' : '' %>">