app/views/biodata/index.html.erb

                <i class="fas fa-layer-group mr-1"></i>
                <%= biodatum.biodata_sections.count %> sections
---
SELECT COUNT(*) FROM "biodata_sections" WHERE "biodata_sections"."biodatum_id" = ?  [["biodatum_id", 3]]