app/models/bio.rb

  def create_with_default_sections
    transaction do
      save!
      Bio.default_sections.each do |section_attrs|
        section = sections.create!(section_attrs)
        Bio.default_fields_for_section(section_attrs[:name]).each do |field_attrs|
          section.fields.create!(field_attrs)
---
INSERT INTO "sections" ("bio_id", "name", "position", "created_at", "updated_at") VALUES (1, 'Personal Details', 1, '2025-08-03 04:37:44.143281', '2025-08-03 04:37:44.143281') RETURNING "id"
INSERT INTO "fields" ("section_id", "label", "value", "position", "created_at", "updated_at") VALUES (1, 'Full Name', '', 1, '2025-08-03 04:37:44.187169', '2025-08-03 04:37:44.187169') RETURNING "id"

  def generate_slug
    return if slug.present?

    loop do
      self.slug = SecureRandom.alphanumeric(8).downcase
      break unless Bio.exists?(slug: slug)
---
SELECT 1 AS one FROM "bios" WHERE "bios"."slug" = 'zzoihbzp' LIMIT 1

  def generate_edit_token
    return if edit_token.present?

    loop do
      self.edit_token = SecureRandom.uuid
      break unless Bio.exists?(edit_token: edit_token)
---
SELECT 1 AS one FROM "bios" WHERE "bios"."edit_token" = '012fdde9-ac86-4300-bd76-27dd78b08bc7' LIMIT 1