app/models/bio.rb

  def generate_slug
    return if slug.present?

    base_slug = "bio-#{SecureRandom.hex(4)}"
    counter = 1

    while Bio.exists?(slug: base_slug)
---
SELECT 1 AS one FROM "bios" WHERE "bios"."slug" = ? LIMIT ?  [["slug", "bio-9783fd15"], ["LIMIT", 1]]
SELECT 1 AS one FROM "bios" WHERE "bios"."slug" = ? LIMIT ?  [["slug", "bio-d61c3758"], ["LIMIT", 1]]

  def generate_edit_token
    return if edit_token.present?

    loop do
      self.edit_token = SecureRandom.uuid
      break unless Bio.exists?(edit_token: edit_token)
---
SELECT 1 AS one FROM "bios" WHERE "bios"."edit_token" = ? LIMIT ?  [["edit_token", "[FILTERED]"], ["LIMIT", 1]]